########################################################################
# Formality Verification Script generated by:
#     fm_mk_script -o fm.tcl "async_fifo.svf"
# Formality (R)  Version O-2018.06-SP1 -- Jul 18, 2018
# Copyright (C) 2007-2010 Synopsys, Inc. All rights reserved.
########################################################################

########################################################################
# Synopsys Auto Setup Mode
########################################################################

set synopsys_auto_setup true

# Note: The Synopsys Auto Setup mode is less conservative than the
# Formality default mode, and is more likely to result in a successful
# verification out-of-the-box.
#
# Setting synopsys_auto_setup will change the values of the variables
# listed here below.  You may change any of these variables back to
# their default settings to be more conservative.  Uncomment the
# appropriate lines below to revert back to their default settings:

      # set hdlin_ignore_parallel_case true
      # set hdlin_ignore_full_case true
      # set verification_verify_directly_undriven_output true
      # set hdlin_ignore_embedded_configuration false
      # set svf_ignore_unqualified_fsm_information true

########################################################################
# Specify number of processes on the local machine to use in parallel
# Default is 1 core
########################################################################

#set_host_options -max_cores 4

########################################################################
# Setup for instantiated or function-inferred DesignWare components
########################################################################

set hdlin_dwroot /opt/synopsys/syn2018/syn/O-2018.06-SP1

########################################################################
# Search path
########################################################################

set search_path " \
	/home/rfic/Desktop/adapted/async_fifo/syn/. \
	/opt/synopsys/syn2018/syn/O-2018.06-SP1/libraries/syn \
	/opt/synopsys/syn2018/syn/O-2018.06-SP1/minpower/syn \
	/opt/synopsys/syn2018/syn/O-2018.06-SP1/dw/syn_ver \
	/opt/synopsys/syn2018/syn/O-2018.06-SP1/dw/sim_ver \
	/home/rfic/Desktop/adapted/async_fifo/syn/../libs/mw_lib/sc/LM \
	/home/rfic/Desktop/adapted/async_fifo/syn/./rtl \
	/home/rfic/Desktop/adapted/async_fifo/syn/./scripts \
	/home/rfic/Desktop/adapted/async_fifo/syn/./mapped \
	/home/rfic/Desktop/adapted/async_fifo/syn/./unmapped \
	/home/rfic/Desktop/adapted/async_fifo/syn/./rtl "

########################################################################
# Read in the SVF file(s)
########################################################################

set_svf async_fifo.svf

########################################################################
# Read in the libraries
########################################################################

read_db -technology_library sc_max.db


########################################################################
########################################################################

# set link_library " * dw_foundation.sldb sc_max.db "

########################################################################
# Read in the Reference Design as verilog/vhdl source code
########################################################################

set hdlin_sverilog_std 2012
set hdlin_vhdl_std 2008
set hdlin_vrlg_std 2005
read_verilog -r -libname WORK  \
	../rtl/async_fifo.v
read_verilog -r -libname WORK  \
	../rtl/fifo_mem.v
read_verilog -r -libname WORK  \
	../rtl/rptr_empty.v
read_verilog -r -libname WORK  \
	../rtl/wptr_full.v
read_verilog -r -libname WORK  \
	../rtl/sync.v
set_top r:/WORK/async_fifo


########################################################################
# Read in the Implementation Design created from DC
#
# Choose the file that you wish to verify
########################################################################

# USER INTERVENTION REQUIRED HERE:
# read_ddc -i /home/rfic/Desktop/adapted/async_fifo/syn/unmapped/async_fifo.ddc
# read_verilog -i /home/rfic/Desktop/adapted/async_fifo/syn/mapped/async_fifo.v
 read_ddc -i /home/rfic/Desktop/adapted/async_fifo/syn/mapped/async_fifo.ddc
set_top i:/WORK/async_fifo

########################################################################
# Verify and Report
#
# If the verification is not successful, the session will be saved and reports
# will be generated to help debug the failed or inconclusive verification.
########################################################################

if { ![verify] } {
  set DESIGN_NAME                   "async_fifo"  ;#  The name of the top-level design
  set FMRM_FAILING_SESSION_NAME     ${DESIGN_NAME}
  set FMRM_FAILING_POINTS_REPORT    ${DESIGN_NAME}.fmv_failing_points.rpt
  set FMRM_ABORTED_POINTS_REPORT    ${DESIGN_NAME}.fmv_aborted_points.rpt

  set REPORTS_DIR "reports"

  file mkdir ${REPORTS_DIR}

  save_session -replace ${REPORTS_DIR}/${FMRM_FAILING_SESSION_NAME}
  report_failing_points > ${REPORTS_DIR}/${FMRM_FAILING_POINTS_REPORT}
  report_aborted > ${REPORTS_DIR}/${FMRM_ABORTED_POINTS_REPORT}
}
